Услуги/src/DataProcessors/РаботаСЗапросами/РаботаСЗапросами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСЗапросами</name>
</mdclass:DataProcessor>

Услуги/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Услуги/src/DataProcessors/РаботаСЗапросами/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = "ВЫБРАТЬ
	|    ПриходнаяНакладнаяМатериалы.Материал,
	|    ПриходнаяНакладнаяМатериалы.Ссылка.Дата,
	|    ПриходнаяНакладнаяМатериалы.Ссылка.Номер
	|ПОМЕСТИТЬ НакладнаяМатериалы
	|ИЗ
	|    Документ.ПриходнаяНакладная.Материалы КАК ПриходнаяНакладнаяМатериалы
	|ГДЕ
	|    ПриходнаяНакладнаяМатериалы.Ссылка.Номер = &НомерНакладной";
	Запрос.УстановитьПараметр("НомерНакладной", "000000001");
	Запрос.Выполнить();
	
	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст = "ВЫБРАТЬ
	|    Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	|    Номенклатура.Наименование КАК Наименование,
	|    ЕСТЬNULL(НакладнаяМатериалы.Дата, 0) КАК Дата,
	|    ЕСТЬNULL(НакладнаяМатериалы.Номер, 0) КАК Номер
	|ИЗ
	|    Справочник.Номенклатура КАК Номенклатура
	|         ЛЕВОЕ СОЕДИНЕНИЕ НакладнаяМатериалы КАК НакладнаяМатериалы
	|         ПО Номенклатура.Ссылка = НакладнаяМатериалы.Материал
	|
	|УПОРЯДОЧИТЬ ПО
	|    Номенклатура.Ссылка ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	РезультатЗапроса = Запрос2.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();

 

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда
			Сообщить("Группа: " + Выборка.Наименование);
		ИначеЕсли Выборка.Дата = 0 Тогда
			Сообщить("Материал: " + Выборка.Наименование + " – поступлений нет");
		Иначе    
			Сообщить("Материал: " + Выборка.Наименование + " Дата: " + Выборка.Дата + " Номер: " + Выборка.Номер);
	 	КонецЕсли;
 	КонецЦикла;
КонецПроцедуры;
